app/controllers/portfolios_controller.rb

  def create
    @portfolio_item = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My new portfolio"], ["subtitle", "asdasdasdasd"], ["body", "asdasdasd"], ["created_at", "2017-11-12 12:12:42.384736"], ["updated_at", "2017-11-12 12:12:42.384736"]]

  def update
    respond_to do |format|
      if @portfolio_item.update(portfolio_params)
---
UPDATE "portfolios" SET "subtitle" = $1, "body" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4

  def destroy
    #destroy
    @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 10]]

  def set_portfolio
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]